import { useState, useEffect, useRef } from 'react';

export function MainContent({ selectedMenu, isLoading = false, isSidebarOpen }) {
	// Создаем ссылку на элемент <main>
	const mainRef = useRef(null);

	// Функция для прокрутки вниз
	const scrollToBottom = () => {
		if (mainRef.current) {
			mainRef.current.scrollTop = mainRef.current.scrollHeight;
		}
	};

	// Прокручиваем вниз при изменении selectedMenu
	useEffect(() => {
		scrollToBottom();
	}, [selectedMenu]);

	const renderMainContent = () => {
		switch (selectedMenu) {
			case 'Главная':
				return (
					<h1 className="p-4 break-words">
						домдомдомдомдомдоaомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
						домдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдомдом
					</h1>
				);
			case 'Канальная аналитика':
				return <h1 className="p-4">аналитика</h1>;
			case 'Календарь броней':
				return <h1 className="p-4">календарь</h1>;
			case 'Страны':
				return <h1 className="p-4">страна</h1>;
			case 'Финансы':
				return <h1 className="p-4">финансы</h1>;
			case 'Настройки':
				return <h1 className="p-4">настройки</h1>;
			default:
				return <div className="p-4">Выберите пункт меню</div>;
		}
	};

	return (
		<main
			ref={mainRef} // Привязываем ref к элементу <main>
			className={`md:fixed rounded-2xl bg-white pr-4 md:pt-2 md:px-6 md:left-0 w-screen md:w-[calc(100vw-17rem)] h-[calc(100vh-5rem)] overflow-y-auto overflow-x-hidden ${isSidebarOpen ? 'translate-x-full' : '-translate-x-0'
				} md:translate-x-0 z-10`}
		>
			<h1 className="text-lg sm:text-xl md:text-2xl font-bold mb-6">Дашборд</h1>
			{isLoading ? <div className="p-4">Loading...</div> : renderMainContent()}
		</main>
	);
}

export default MainContent;